Revit 2024 API
FabricationPartSizeMap.PaletteId Property
 The palette identifier of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.2
Syntax
C#
public int PaletteId { get; set; }
Visual Basic
Public Property PaletteId As Integer
	Get
	Set
Visual C++
public:
property int PaletteId {
	int get ();
	void set (int value);
}
See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace